# FilterNumericEquals Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericEquals Class
Members See Also
---
Tests whether numeric values from the document are equal to a certain value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterNumericEquals : FilterNumericRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterNumericEquals _
	Inherits FilterNumericRuleEvaluator
```

Visual C++
---
```text
public ref class FilterNumericEquals : public FilterNumericRuleEvaluator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterNumericRuleEvaluator Autodesk.Revit.DB..::..FilterNumericEquals
# See Also
FilterNumericEquals Members
Autodesk.Revit.DB Namespace